In [1]:
# importing pandas and numpy
import pandas as pd
import numpy as np

In [2]:
# importing reviews file from downloads
reviews= pd.read_csv('c:/users/babit/downloads/reviews_pillow palooza.tsv',delimiter='\t', index_col=0)

In [3]:
# Checking first 5 rows of reviews file
reviews.head()

              host_name   last_review
listing_id
2595           Jennifer   May 21 2019
3831        LisaRoxanne  July 05 2019
5099              Chris  June 22 2019
5178           Shunichi  June 24 2019
5238                Ben  June 09 2019

In [4]:
#importing prices file from downloads

prices= pd.read_csv('c:/users/babit/downloads/prices_pillow palooza.csv',index_col=0)

In [5]:
# Checking first 5 rows of prices file
prices.head()

                  price                nbhood_full
listing_id
2595        225 dollars         Manhattan, Midtown
3831         89 dollars     Brooklyn, Clinton Hill
5099        200 dollars     Manhattan, Murray Hill
5178         79 dollars  Manhattan, Hell's Kitchen
5238        150 dollars       Manhattan, Chinatown

In [6]:
#importing room_types file from downloads
room_types= pd.read_excel('c:/users/babit/downloads/room_types_pillow palooza.xlsx',index_col=0)

In [7]:
#checking first five rows of room_types
room_types.head()

                                          description        room_type
listing_id
2595                            Skylit Midtown Castle  Entire home/apt
3831                  Cozy Entire Floor of Brownstone  Entire home/apt
5099        Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
5178                  Large Furnished Room Near B'way     private room
5238               Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [8]:
prices.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25209 entries, 2595 to 36455809
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   price        25209 non-null  object
 1   nbhood_full  25209 non-null  object
dtypes: object(2)
memory usage: 590.8+ KB

In [9]:
#remove dollars from price column
prices["price"] = prices["price"].astype(str)
prices["price"] = prices["price"].str.replace('dollars','')

#convert price column to numeric
prices["price"] = pd.to_numeric(prices["price"])

In [10]:
prices.head(1)

            price         nbhood_full
listing_id
2595          225  Manhattan, Midtown

In [11]:
#price is 0
zero_cost_listings = prices[prices['price'] == 0]

In [12]:
#filter for price=0
prices = prices[prices['price'] != 0]

In [13]:
# calculate average price
average_price = round(prices['price'].mean(), 2)

In [14]:
average_price

141.82

In [15]:
# comparing costs to the private rental market
#Create a new column price_per_month
prices['price_per_month']=prices['price']*365/12

In [16]:
#Calculate average_price_per_month
average_price_per_month=round(prices['price_per_month'].mean(),2)

In [17]:
average_price_per_month

4313.61

In [18]:
#Difference in rental; private rental market=3100/month
Difference=round((average_price_per_month-3100),2)

In [19]:
Difference

1213.61

In [20]:
#step 5:cleaning room_type column
room_types['room_type']=room_types['room_type'].str.lower()

# Update the room_type column to category data type
room_types['room_type']=room_types['room_type'].astype('category')

In [21]:
# Create the variable room_frequencies
room_frequencies = room_types["room_type"].value_counts()

In [22]:
room_frequencies

entire home/apt    13266
private room       11356
shared room          587
Name: room_type, dtype: int64

In [23]:
# Change the data type of the last_review column to datetime
reviews["last_review"] = pd.to_datetime(reviews["last_review"])

In [24]:
reviews.head(2)

              host_name last_review
listing_id
2595           Jennifer  2019-05-21
3831        LisaRoxanne  2019-07-05

In [25]:
# Create first_reviewed, the earliest review date
first_reviewed = reviews["last_review"].dt.date.min()

# Create last_reviewed, the most recent review date
last_reviewed = reviews["last_review"].dt.date.max()

In [26]:
first_reviewed

datetime.date(2019, 1, 1)

In [27]:
last_reviewed

datetime.date(2019, 7, 9)

In [28]:
 #Step 7. Joining the DataFrames

# Merge prices and room_types to create rooms_and_prices
rooms_and_prices = prices.merge(room_types, how="outer", on="listing_id")

# Merge rooms_and_prices with the reviews DataFrame to create airbnb_merged
airbnb_merged = rooms_and_prices.merge(reviews, how="outer", on="listing_id")

In [29]:
rooms_and_prices.head(2)

,price,nbhood_full,price_per_month,description,room_type
listing_id,,,,,
2595,225.0,"Manhattan, Midtown",6843.750000,Skylit Midtown Castle,entire home/apt
3831,89.0,"Brooklyn, Clinton Hill",2707.083333,Cozy Entire Floor of Brownstone,entire home/apt

In [30]:
airbnb_merged.head()

,price,nbhood_full,price_per_month,description,room_type,host_name,last_review
listing_id,,,,,,,
2595,225.0,"Manhattan, Midtown",6843.750000,Skylit Midtown Castle,entire home/apt,Jennifer,2019-05-21
3831,89.0,"Brooklyn, Clinton Hill",2707.083333,Cozy Entire Floor of Brownstone,entire home/apt,LisaRoxanne,2019-07-05
5099,200.0,"Manhattan, Murray Hill",6083.333333,Large Cozy 1 BR Apartment In Midtown East,entire home/apt,Chris,2019-06-22
5178,79.0,"Manhattan, Hell's Kitchen",2402.916667,Large Furnished Room Near B'way,private room,Shunichi,2019-06-24
5238,150.0,"Manhattan, Chinatown",4562.500000,Cute & Cozy Lower East Side 1 bdrm,entire home/apt,Ben,2019-06-09

In [31]:
# Drop missing values from airbnb_merged
airbnb_merged.dropna(inplace=True)

In [32]:
#calculate duplicates
duplicate_rows = airbnb_merged[airbnb_merged.duplicated()]

In [33]:
duplicate_rows

,price,nbhood_full,price_per_month,description,room_type,host_name,last_review
listing_id,,,,,,,
253475,199.0,"Brooklyn, Greenpoint",6052.916667,Loft Suite @ The Box House Hotel,entire home/apt,The Box House Hotel,2019-06-24
294227,199.0,"Brooklyn, Greenpoint",6052.916667,Loft Suite @ The Box House Hotel,entire home/apt,The Box House Hotel,2019-06-22
34341449,50.0,"Queens, Hollis",1520.833333,SINGLE ROOM AVAILABLE IN JAMAICA NEAR JFK & LGA,private room,Moolchand,2019-06-30

In [34]:
num_duplicates=airbnb_merged.duplicated().sum()

In [35]:
num_duplicates

3

In [36]:
# Step 8. Analyzing listing prices by NYC borough

# Extract information from the nbhood_full column and store as a new column, borough
airbnb_merged["borough"] = airbnb_merged["nbhood_full"].str.partition(",")[0]

In [37]:
#Checking column borough
(airbnb_merged['borough']).head(3)

listing_id
2595    Manhattan
3831     Brooklyn
5099    Manhattan
Name: borough, dtype: object

In [38]:
# Group by borough and calculate summary statistics
boroughs = airbnb_merged.groupby("borough")["price"].agg(["sum", "mean", "median", "count"])

In [39]:
boroughs

                     sum        mean  median  count
borough
Bronx            55156.0   79.247126    65.0    696
Brooklyn       1275250.0  122.021816    95.0  10451
Manhattan      1898417.0  184.044304   149.0  10315
Queens          320715.0   92.826339    70.0   3455
Staten Island    22974.0   86.044944    71.0    267

In [40]:
# Round boroughs to 2 decimal places, and sort by mean in descending order
boroughs = round(boroughs,2).sort_values("mean", ascending=False)

In [41]:
boroughs

                     sum    mean  median  count
borough
Manhattan      1898417.0  184.04   149.0  10315
Brooklyn       1275250.0  122.02    95.0  10451
Queens          320715.0   92.83    70.0   3455
Staten Island    22974.0   86.04    71.0    267
Bronx            55156.0   79.25    65.0    696

In [42]:
# Step 9. Price range by borough

# Create labels for the price range, label_names
label_names = ["Budget", "Average", "Expensive", "Extravagant"]

# Create the label ranges, ranges
ranges = [0, 69, 175, 350, np.inf]

In [43]:
# Insert new column, price_range, into DataFrame
airbnb_merged["price_range"] = pd.cut(airbnb_merged["price"], bins=ranges, labels=label_names)

In [44]:
airbnb_merged["price_range"].head(2)

listing_id
2595    Expensive
3831      Average
Name: price_range, dtype: category
Categories (4, object): ['Budget' < 'Average' < 'Expensive' < 'Extravagant']

In [45]:
# Calculate occurence frequencies for each label, prices_by_borough
prices_by_borough = airbnb_merged.groupby(["borough", "price_range"])["price_range"].count()

In [46]:
prices_by_borough

borough        price_range
Bronx          Budget          381
               Average         285
               Expensive        25
               Extravagant       5
Brooklyn       Budget         3194
               Average        5532
               Expensive      1466
               Extravagant     259
Manhattan      Budget         1148
               Average        5285
               Expensive      3072
               Extravagant     810
Queens         Budget         1631
               Average        1505
               Expensive       291
               Extravagant      28
Staten Island  Budget          124
               Average         123
               Expensive        20
               Extravagant       0
Name: price_range, dtype: int64

In [47]:
# Step 10. Storing the final result

airbnb_analysis = {'avg_price':average_price,
            'average_price_per_month': average_price_per_month,  
            'difference':Difference,          
            'room_frequencies':room_frequencies, 
            'first_reviewed': first_reviewed,
            'last_reviewed': last_reviewed,
            'prices_by_borough':prices_by_borough}

In [48]:
airbnb_analysis

{'avg_price': 141.82,
 'average_price_per_month': 4313.61,
 'difference': 1213.61,
 'room_frequencies': entire home/apt    13266
 private room       11356
 shared room          587
 Name: room_type, dtype: int64,
 'first_reviewed': datetime.date(2019, 1, 1),
 'last_reviewed': datetime.date(2019, 7, 9),
 'prices_by_borough': borough        price_range
 Bronx          Budget          381
                Average         285
                Expensive        25
                Extravagant       5
 Brooklyn       Budget         3194
                Average        5532
                Expensive      1466
                Extravagant     259
 Manhattan      Budget         1148
                Average        5285
                Expensive      3072
                Extravagant     810
 Queens         Budget         1631
                Average        1505
                Expensive       291
                Extravagant      28
 Staten Island  Budget          124
                Average         123
                Expensive        20
                Extravagant       0
 Name: price_range, dtype: int64}

In [49]:
airbnb_merged.to_csv('airbnb_merged.csv')